//Домашнее задание
//Вычислить значение формулы (a*b)/(c+d), где a,b,c,d - некоторые целые числа.
//Результат выыести на экран.

int a = 5;
int b = 8;
int c = 6;
int d = 3;
int quotient = (a*b)/(c+d);
Console.WriteLine(quotient);
